; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ztravel-2-5)
  (:domain zeno-travel)
  (:objects plane1 -  aircraft plane2 -  aircraft person1 -  person person2 -  person person4 -  person person3 -  person person5 -  person city0 -  city city1 -  city city2 -  city city3 -  city fl0 -  flevel fl1 -  flevel fl2 -  flevel fl3 -  flevel )
  (:init (next fl1 fl2) (next fl0 fl1) (at person3 city3) (next fl2 fl3) (in person4 plane2) (in person5 plane1) (at plane1 city1) (fuel-level plane1 fl0) (at plane2 city3) (fuel-level plane2 fl0) (at person1 city3) (at person2 city1) )
  (:goal (and (next fl1 fl2)(next fl0 fl1)(at person3 city3)(next fl2 fl3)(at plane1 city1)(at plane2 city3)(at person1 city3)(at person2 city1)(at person4 city3)(at person5 city1)(fuel-level plane1 fl1)(fuel-level plane2 fl1)(not (in person1 plane1))(not (in person1 plane2))(not (in person2 plane1))(not (in person2 plane2))(not (in person3 plane1))(not (in person3 plane2))(not (in person4 plane1))(not (in person4 plane2))(not (in person5 plane1))(not (in person5 plane2))(not (fuel-level plane1 fl0))(not (fuel-level plane1 fl2))(not (fuel-level plane1 fl3))(not (fuel-level plane2 fl0))(not (fuel-level plane2 fl2))(not (fuel-level plane2 fl3))(not (next fl0 fl0))(not (next fl0 fl2))(not (next fl0 fl3))(not (next fl1 fl0))(not (next fl1 fl1))(not (next fl1 fl3))(not (next fl2 fl0))(not (next fl2 fl1))(not (next fl2 fl2))(not (next fl3 fl0))(not (next fl3 fl1))(not (next fl3 fl2))(not (next fl3 fl3)))))

; plan
1. (debark person4 plane2 city3)
   deleted: (in person4 plane2)
   added: (at person4 city3)
   goals met: 35 of 41
2. (debark person5 plane1 city1)
   deleted: (in person5 plane1)
   added: (at person5 city1)
   goals met: 37 of 41
3. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 39 of 41
4. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 41 of 41
